GopalSaraf/Practicals/PSDL/include/proc/pic18f46k40.inc
#define X8                               BANKMASK(CRCXORH), 0, a
#define X9                               BANKMASK(CRCXORH), 1, a
#define ZCDIE                            BANKMASK(PIE2), 6, b
#define ZCDIF                            BANKMASK(PIR2), 6, b
#define ZCDINTN                          BANKMASK(ZCDCON), 0, b
#define ZCDINTP                          BANKMASK(ZCDCON), 1, b
#define ZCDIP                            BANKMASK(IPR2), 6, b
#define ZCDMD                            BANKMASK(PMD2), 0, b
#define ZCDOUT                           BANKMASK(ZCDCON), 5, b
#define ZCDPOL                           BANKMASK(ZCDCON), 4, b
#define ZCDSEN                           BANKMASK(ZCDCON), 7, b
#define ZERO                             BANKMASK(STATUS), 2, a
#define nADDRESS1                        BANKMASK(SSP1STAT), 5, a
#define nADDRESS2                        BANKMASK(SSP2STAT), 5, b
#define nBOR                             BANKMASK(PCON0), 0, a
#define nPD                              BANKMASK(STATUS), 5, a
#define nPOR                             BANKMASK(PCON0), 1, a
#define nRI                              BANKMASK(PCON0), 2, a
#define nRMCLR                           BANKMASK(PCON0), 3, a
#define nRWDT                            BANKMASK(PCON0), 4, a
#define nT1SYNC                          BANKMASK(T1CON), 2, a
#define nT3SYNC                          BANKMASK(T3CON), 2, a
#define nT5SYNC                          BANKMASK(T5CON), 2, a
#define nTO                              BANKMASK(STATUS), 6, a
#define nWDTWV                           BANKMASK(PCON0), 5, a
#define nWRITE1                          BANKMASK(SSP1STAT), 2, a
#define nWRITE2                          BANKMASK(SSP2STAT), 2, b

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec,lowdata
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec,lowdata
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec,lowdata
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec,lowdata
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec,lowdata
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec,lowdata
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec,lowdata
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec,lowdata
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec,lowdata
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec,lowdata
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec,lowdata
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec,lowdata
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec,lowdata
psect udata_bank13,class=BANK13,space=SPACE_DATA,noexec,lowdata
psect udata_bank14,class=BANK14,space=SPACE_DATA,noexec,lowdata
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=1,noexec

#endif // _XC_INC_

#endif // _PIC18F46K40_INC_
